#include <stdio.h> // Підключення бібліотеки 
#include <math.h>  // Підключення бібліотеки

int main() // Підключення головної функції
{
    float f = 0.0, a = 3, b = 4.6, c, x; // Введення змінних
    printf("Input c and x:\n"); // Виведення тексту на екран
    scanf_s("%f%f", &c, &x); // Зчитування даних та їх запис

    if ((tan(c - b) + pow(a, 2)) == 0) // Введення умови
    {
        printf("Denominator != 0\n"); // Виведення тексту на екран
        return 1; // Помилкове завершення програми
    }
    if (c == 0) // Введення умови
    {
        printf("c != 0\n"); // Виведення тексту на екран
        return 1; // Помилкове завершення програми
    }

    f = ((3 * sin(a + b / c)) / (tan(c - b) + pow(a, 2))) * b * pow(x, 2); // Формула, за якою здійснюється обчислення
    printf("f = %f\n", f); // Виведення тексту на екран

    return 0; // Успішне завершення програми
}



